MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFK124/mcu.h
extern volatile __C1RXF1bits_t C1RXF1bits __asm__ ("C1RXF1") __attribute__((section("sfrs"), address(0xBF880150)));
extern volatile uint32_t        C1RXF1CLR __attribute__((section("sfrs"),address(0xBF880154)));
extern volatile uint32_t        C1RXF1SET __attribute__((section("sfrs"),address(0xBF880158)));
extern volatile uint32_t        C1RXF1INV __attribute__((section("sfrs"),address(0xBF88015C)));
#define C1RXF2 C1RXF2
extern volatile uint32_t   C1RXF2 __attribute__((section("sfrs"), address(0xBF880160)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF2bits_t;
extern volatile __C1RXF2bits_t C1RXF2bits __asm__ ("C1RXF2") __attribute__((section("sfrs"), address(0xBF880160)));
extern volatile uint32_t        C1RXF2CLR __attribute__((section("sfrs"),address(0xBF880164)));
extern volatile uint32_t        C1RXF2SET __attribute__((section("sfrs"),address(0xBF880168)));
extern volatile uint32_t        C1RXF2INV __attribute__((section("sfrs"),address(0xBF88016C)));
#define C1RXF3 C1RXF3
extern volatile uint32_t   C1RXF3 __attribute__((section("sfrs"), address(0xBF880170)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF3bits_t;
extern volatile __C1RXF3bits_t C1RXF3bits __asm__ ("C1RXF3") __attribute__((section("sfrs"), address(0xBF880170)));
extern volatile uint32_t        C1RXF3CLR __attribute__((section("sfrs"),address(0xBF880174)));
extern volatile uint32_t        C1RXF3SET __attribute__((section("sfrs"),address(0xBF880178)));
extern volatile uint32_t        C1RXF3INV __attribute__((section("sfrs"),address(0xBF88017C)));
#define C1RXF4 C1RXF4
extern volatile uint32_t   C1RXF4 __attribute__((section("sfrs"), address(0xBF880180)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF4bits_t;
extern volatile __C1RXF4bits_t C1RXF4bits __asm__ ("C1RXF4") __attribute__((section("sfrs"), address(0xBF880180)));
extern volatile uint32_t        C1RXF4CLR __attribute__((section("sfrs"),address(0xBF880184)));
extern volatile uint32_t        C1RXF4SET __attribute__((section("sfrs"),address(0xBF880188)));
extern volatile uint32_t        C1RXF4INV __attribute__((section("sfrs"),address(0xBF88018C)));
#define C1RXF5 C1RXF5
extern volatile uint32_t   C1RXF5 __attribute__((section("sfrs"), address(0xBF880190)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF5bits_t;
extern volatile __C1RXF5bits_t C1RXF5bits __asm__ ("C1RXF5") __attribute__((section("sfrs"), address(0xBF880190)));
extern volatile uint32_t        C1RXF5CLR __attribute__((section("sfrs"),address(0xBF880194)));
extern volatile uint32_t        C1RXF5SET __attribute__((section("sfrs"),address(0xBF880198)));
extern volatile uint32_t        C1RXF5INV __attribute__((section("sfrs"),address(0xBF88019C)));
#define C1RXF6 C1RXF6
extern volatile uint32_t   C1RXF6 __attribute__((section("sfrs"), address(0xBF8801A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF6bits_t;
extern volatile __C1RXF6bits_t C1RXF6bits __asm__ ("C1RXF6") __attribute__((section("sfrs"), address(0xBF8801A0)));
extern volatile uint32_t        C1RXF6CLR __attribute__((section("sfrs"),address(0xBF8801A4)));
extern volatile uint32_t        C1RXF6SET __attribute__((section("sfrs"),address(0xBF8801A8)));
extern volatile uint32_t        C1RXF6INV __attribute__((section("sfrs"),address(0xBF8801AC)));
#define C1RXF7 C1RXF7
extern volatile uint32_t   C1RXF7 __attribute__((section("sfrs"), address(0xBF8801B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF7bits_t;
extern volatile __C1RXF7bits_t C1RXF7bits __asm__ ("C1RXF7") __attribute__((section("sfrs"), address(0xBF8801B0)));
extern volatile uint32_t        C1RXF7CLR __attribute__((section("sfrs"),address(0xBF8801B4)));
extern volatile uint32_t        C1RXF7SET __attribute__((section("sfrs"),address(0xBF8801B8)));
extern volatile uint32_t        C1RXF7INV __attribute__((section("sfrs"),address(0xBF8801BC)));
#define C1RXF8 C1RXF8
extern volatile uint32_t   C1RXF8 __attribute__((section("sfrs"), address(0xBF8801C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF8bits_t;
extern volatile __C1RXF8bits_t C1RXF8bits __asm__ ("C1RXF8") __attribute__((section("sfrs"), address(0xBF8801C0)));
extern volatile uint32_t        C1RXF8CLR __attribute__((section("sfrs"),address(0xBF8801C4)));
extern volatile uint32_t        C1RXF8SET __attribute__((section("sfrs"),address(0xBF8801C8)));
extern volatile uint32_t        C1RXF8INV __attribute__((section("sfrs"),address(0xBF8801CC)));
#define C1RXF9 C1RXF9
extern volatile uint32_t   C1RXF9 __attribute__((section("sfrs"), address(0xBF8801D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF9bits_t;
extern volatile __C1RXF9bits_t C1RXF9bits __asm__ ("C1RXF9") __attribute__((section("sfrs"), address(0xBF8801D0)));
extern volatile uint32_t        C1RXF9CLR __attribute__((section("sfrs"),address(0xBF8801D4)));
extern volatile uint32_t        C1RXF9SET __attribute__((section("sfrs"),address(0xBF8801D8)));
extern volatile uint32_t        C1RXF9INV __attribute__((section("sfrs"),address(0xBF8801DC)));
#define C1RXF10 C1RXF10
extern volatile uint32_t   C1RXF10 __attribute__((section("sfrs"), address(0xBF8801E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF10bits_t;
