MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFK124/mcu.h
extern volatile __C1FIFOCON16bits_t C1FIFOCON16bits __asm__ ("C1FIFOCON16") __attribute__((section("sfrs"), address(0xBF880750)));
extern volatile uint32_t        C1FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF880754)));
extern volatile uint32_t        C1FIFOCON16SET __attribute__((section("sfrs"),address(0xBF880758)));
extern volatile uint32_t        C1FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88075C)));
#define C1FIFOINT16 C1FIFOINT16
extern volatile uint32_t   C1FIFOINT16 __attribute__((section("sfrs"), address(0xBF880760)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT16bits_t;
extern volatile __C1FIFOINT16bits_t C1FIFOINT16bits __asm__ ("C1FIFOINT16") __attribute__((section("sfrs"), address(0xBF880760)));
extern volatile uint32_t        C1FIFOINT16CLR __attribute__((section("sfrs"),address(0xBF880764)));
extern volatile uint32_t        C1FIFOINT16SET __attribute__((section("sfrs"),address(0xBF880768)));
extern volatile uint32_t        C1FIFOINT16INV __attribute__((section("sfrs"),address(0xBF88076C)));
#define C1FIFOUA16 C1FIFOUA16
extern volatile uint32_t   C1FIFOUA16 __attribute__((section("sfrs"), address(0xBF880770)));
extern volatile uint32_t        C1FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF880774)));
extern volatile uint32_t        C1FIFOUA16SET __attribute__((section("sfrs"),address(0xBF880778)));
extern volatile uint32_t        C1FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88077C)));
#define C1FIFOCI16 C1FIFOCI16
extern volatile uint32_t   C1FIFOCI16 __attribute__((section("sfrs"), address(0xBF880780)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI16bits_t;
extern volatile __C1FIFOCI16bits_t C1FIFOCI16bits __asm__ ("C1FIFOCI16") __attribute__((section("sfrs"), address(0xBF880780)));
extern volatile uint32_t        C1FIFOCI16CLR __attribute__((section("sfrs"),address(0xBF880784)));
extern volatile uint32_t        C1FIFOCI16SET __attribute__((section("sfrs"),address(0xBF880788)));
extern volatile uint32_t        C1FIFOCI16INV __attribute__((section("sfrs"),address(0xBF88078C)));
#define C1FIFOCON17 C1FIFOCON17
extern volatile uint32_t   C1FIFOCON17 __attribute__((section("sfrs"), address(0xBF880790)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON17bits_t;
extern volatile __C1FIFOCON17bits_t C1FIFOCON17bits __asm__ ("C1FIFOCON17") __attribute__((section("sfrs"), address(0xBF880790)));
extern volatile uint32_t        C1FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF880794)));
extern volatile uint32_t        C1FIFOCON17SET __attribute__((section("sfrs"),address(0xBF880798)));
extern volatile uint32_t        C1FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88079C)));
#define C1FIFOINT17 C1FIFOINT17
extern volatile uint32_t   C1FIFOINT17 __attribute__((section("sfrs"), address(0xBF8807A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT17bits_t;
extern volatile __C1FIFOINT17bits_t C1FIFOINT17bits __asm__ ("C1FIFOINT17") __attribute__((section("sfrs"), address(0xBF8807A0)));
extern volatile uint32_t        C1FIFOINT17CLR __attribute__((section("sfrs"),address(0xBF8807A4)));
extern volatile uint32_t        C1FIFOINT17SET __attribute__((section("sfrs"),address(0xBF8807A8)));
extern volatile uint32_t        C1FIFOINT17INV __attribute__((section("sfrs"),address(0xBF8807AC)));
#define C1FIFOUA17 C1FIFOUA17
extern volatile uint32_t   C1FIFOUA17 __attribute__((section("sfrs"), address(0xBF8807B0)));
extern volatile uint32_t        C1FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF8807B4)));
extern volatile uint32_t        C1FIFOUA17SET __attribute__((section("sfrs"),address(0xBF8807B8)));
extern volatile uint32_t        C1FIFOUA17INV __attribute__((section("sfrs"),address(0xBF8807BC)));
#define C1FIFOCI17 C1FIFOCI17
extern volatile uint32_t   C1FIFOCI17 __attribute__((section("sfrs"), address(0xBF8807C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI17bits_t;
extern volatile __C1FIFOCI17bits_t C1FIFOCI17bits __asm__ ("C1FIFOCI17") __attribute__((section("sfrs"), address(0xBF8807C0)));
extern volatile uint32_t        C1FIFOCI17CLR __attribute__((section("sfrs"),address(0xBF8807C4)));
extern volatile uint32_t        C1FIFOCI17SET __attribute__((section("sfrs"),address(0xBF8807C8)));
extern volatile uint32_t        C1FIFOCI17INV __attribute__((section("sfrs"),address(0xBF8807CC)));
#define C1FIFOCON18 C1FIFOCON18
extern volatile uint32_t   C1FIFOCON18 __attribute__((section("sfrs"), address(0xBF8807D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON18bits_t;
extern volatile __C1FIFOCON18bits_t C1FIFOCON18bits __asm__ ("C1FIFOCON18") __attribute__((section("sfrs"), address(0xBF8807D0)));
extern volatile uint32_t        C1FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8807D4)));
extern volatile uint32_t        C1FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8807D8)));
extern volatile uint32_t        C1FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8807DC)));
#define C1FIFOINT18 C1FIFOINT18
extern volatile uint32_t   C1FIFOINT18 __attribute__((section("sfrs"), address(0xBF8807E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT18bits_t;
extern volatile __C1FIFOINT18bits_t C1FIFOINT18bits __asm__ ("C1FIFOINT18") __attribute__((section("sfrs"), address(0xBF8807E0)));
extern volatile uint32_t        C1FIFOINT18CLR __attribute__((section("sfrs"),address(0xBF8807E4)));
extern volatile uint32_t        C1FIFOINT18SET __attribute__((section("sfrs"),address(0xBF8807E8)));
extern volatile uint32_t        C1FIFOINT18INV __attribute__((section("sfrs"),address(0xBF8807EC)));
#define C1FIFOUA18 C1FIFOUA18
extern volatile uint32_t   C1FIFOUA18 __attribute__((section("sfrs"), address(0xBF8807F0)));
extern volatile uint32_t        C1FIFOUA18CLR __attribute__((section("sfrs"),address(0xBF8807F4)));
extern volatile uint32_t        C1FIFOUA18SET __attribute__((section("sfrs"),address(0xBF8807F8)));
extern volatile uint32_t        C1FIFOUA18INV __attribute__((section("sfrs"),address(0xBF8807FC)));
#define C1FIFOCI18 C1FIFOCI18
extern volatile uint32_t   C1FIFOCI18 __attribute__((section("sfrs"), address(0xBF880800)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI18bits_t;
extern volatile __C1FIFOCI18bits_t C1FIFOCI18bits __asm__ ("C1FIFOCI18") __attribute__((section("sfrs"), address(0xBF880800)));
extern volatile uint32_t        C1FIFOCI18CLR __attribute__((section("sfrs"),address(0xBF880804)));
extern volatile uint32_t        C1FIFOCI18SET __attribute__((section("sfrs"),address(0xBF880808)));
extern volatile uint32_t        C1FIFOCI18INV __attribute__((section("sfrs"),address(0xBF88080C)));
#define C1FIFOCON19 C1FIFOCON19
extern volatile uint32_t   C1FIFOCON19 __attribute__((section("sfrs"), address(0xBF880810)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON19bits_t;
extern volatile __C1FIFOCON19bits_t C1FIFOCON19bits __asm__ ("C1FIFOCON19") __attribute__((section("sfrs"), address(0xBF880810)));
extern volatile uint32_t        C1FIFOCON19CLR __attribute__((section("sfrs"),address(0xBF880814)));
extern volatile uint32_t        C1FIFOCON19SET __attribute__((section("sfrs"),address(0xBF880818)));
extern volatile uint32_t        C1FIFOCON19INV __attribute__((section("sfrs"),address(0xBF88081C)));
#define C1FIFOINT19 C1FIFOINT19
extern volatile uint32_t   C1FIFOINT19 __attribute__((section("sfrs"), address(0xBF880820)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOINT19bits_t;
extern volatile __C1FIFOINT19bits_t C1FIFOINT19bits __asm__ ("C1FIFOINT19") __attribute__((section("sfrs"), address(0xBF880820)));
extern volatile uint32_t        C1FIFOINT19CLR __attribute__((section("sfrs"),address(0xBF880824)));
extern volatile uint32_t        C1FIFOINT19SET __attribute__((section("sfrs"),address(0xBF880828)));
extern volatile uint32_t        C1FIFOINT19INV __attribute__((section("sfrs"),address(0xBF88082C)));
#define C1FIFOUA19 C1FIFOUA19
extern volatile uint32_t   C1FIFOUA19 __attribute__((section("sfrs"), address(0xBF880830)));
extern volatile uint32_t        C1FIFOUA19CLR __attribute__((section("sfrs"),address(0xBF880834)));
extern volatile uint32_t        C1FIFOUA19SET __attribute__((section("sfrs"),address(0xBF880838)));
extern volatile uint32_t        C1FIFOUA19INV __attribute__((section("sfrs"),address(0xBF88083C)));
#define C1FIFOCI19 C1FIFOCI19
extern volatile uint32_t   C1FIFOCI19 __attribute__((section("sfrs"), address(0xBF880840)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCI19bits_t;
extern volatile __C1FIFOCI19bits_t C1FIFOCI19bits __asm__ ("C1FIFOCI19") __attribute__((section("sfrs"), address(0xBF880840)));
extern volatile uint32_t        C1FIFOCI19CLR __attribute__((section("sfrs"),address(0xBF880844)));
extern volatile uint32_t        C1FIFOCI19SET __attribute__((section("sfrs"),address(0xBF880848)));
extern volatile uint32_t        C1FIFOCI19INV __attribute__((section("sfrs"),address(0xBF88084C)));
#define C1FIFOCON20 C1FIFOCON20
extern volatile uint32_t   C1FIFOCON20 __attribute__((section("sfrs"), address(0xBF880850)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C1FIFOCON20bits_t;
